package ua.hillel.antonova.lesson02;

/*1. Выведите первые 5 элементов массива, у которого размер 10*/

public class Main {
    public static void main(String[] args) {
        int s[] = new int [10];
        for (int i=0; i < 5; i++) {
            System.out.println(s[i]);
        }
    }

}
